tap "codeclimate/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "martido/brew-graph"
brew "adr-tools"
brew "jpeg"
brew "argocd"
brew "autoconf"
brew "automake"
brew "python@3.10"
brew "azure-cli"
brew "bash"
brew "bfg"
brew "gettext"
brew "glib"
brew "cmake"
brew "dgraph"
brew "docker-clean"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "gcc"
brew "gd"
brew "geos"
brew "hdf5"
brew "libdap"
brew "libspatialite"
brew "little-cms2"
brew "netcdf"
brew "numpy"
brew "gdal"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "guile"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gobject-introspection"
brew "jasper"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "lua"
brew "ncurses"
brew "htop"
brew "httpie"
brew "jpegoptim"
brew "jq"
brew "k3d"
brew "kubernetes-cli"
brew "kustomize"
brew "libexif"
brew "libmagic"
brew "libproxy"
brew "lzlib"
brew "librdkafka"
brew "libxmlsec1"
brew "mackup"
brew "make"
brew "mas"
brew "nano"
brew "nghttp2"
brew "node"
brew "nvm"
brew "openapi-generator"
brew "openjdk@11"
brew "pandoc"
brew "peg"
brew "pipx"
brew "qt"
brew "poppler"
brew "postgis"
brew "potrace"
brew "pyenv"
brew "pyenv-virtualenv", args: ["HEAD"], link: false
brew "pyenv-virtualenvwrapper"
brew "pyqt"
brew "python@3.8"
brew "qwt"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "sip"
brew "sops"
brew "spatialindex"
brew "structurizr-cli"
brew "stunnel"
brew "subversion"
brew "svgo"
brew "tree"
brew "w3m"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "jakehilborn/jakehilborn/displayplacer"
brew "martido/brew-graph/brew-graph"
cask "1password"
cask "alfred"
cask "calibre"
cask "chromedriver"
cask "dash"
cask "devtoys"
cask "docker"
cask "dropbox"
cask "firefox"
cask "fluid"
cask "font-cormorant"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-lato"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-public-sans"
cask "font-source-serif-pro"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "mailplane"
cask "postman"
cask "qgis"
cask "quicklook-csv"
cask "quicklook-json"
cask "shapes"
cask "sublime-text"
mas "Affinity Designer", id: 824171161
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Table Tool", id: 1122008420
mas "The Unarchiver", id: 425424353
