tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "caskroom/fonts"
tap "martido/brew-graph"

# Core utilities
brew "autoconf" # Automatic configure script builder
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "expat" # XML 1.0 parser
brew "gettext", link: true # GNU internationalization (i18n) and localization (l10n) library
brew "git" # Distributed revision control system
brew "git-lfs" # Git extension for versioning large files
brew "graphviz", args: ["with-freetype", "with-librsvg", "with-pango"] # Graph visualization software from AT&T and Bell Labs
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "icu4c" # C/C++ and Java libraries for Unicode and globalization
brew "jq" # Lightweight and flexible command-line JSON processor
brew "libmagic" # Implementation of the file(1) command
brew "libtool" # Generic library support script
brew "libxmlsec1" # XML security library
brew "lzlib" # Data compression library
brew "mackup"
brew "martido/brew-graph/brew-graph"
brew "mas" # Mac App Store manager
brew "nano" # Free (GNU) replacement for the Pico text editor
brew "ncurses" # Text-based UI library
brew "pandoc" # Swiss-army knife of markup format conversion
brew "qwt" # Qt Widgets for Technical Applications
brew "rename" # Perl-powered file rename script with many helpful built-ins
brew "ruby" # Powerful, clean, object-oriented scripting language
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "wget" # Internet file retriever
brew "zlib" # General-purpose lossless data-compression library
brew "zsh"
brew "zsh-completions"

# Database
brew "sqlite" # Command-line interface for SQLite
brew "unixodbc" # ODBC 3 connectivity for UNIX
brew "postgis" # Adds support for geographic objects to PostgreSQL

# Python
brew "python", link: false # Interpreted, interactive, object-oriented programming language
brew "pyenv" # Python version management
brew "pyenv-virtualenv" # Pyenv plugin to manage virtualenv
brew "pyenv-virtualenvwrapper" # Alternative to pyenv for managing virtualenvs
brew "sip" # Tool to create Python bindings for C and C++ libraries
brew "pyqt" # Python bindings for v5 of Qt

# Services
brew "elasticsearch" # Distributed search & analytics engine
brew "redis", restart_service: true # Persistent key-value database, with built-in net interface

# Imaging
brew "jpeg" # Image manipulation library
brew "little-cms2" # Color management engine supporting ICC profiles
brew "ghostscript" # Interpreter for PostScript and PDF
brew "jpegoptim" # Utility to optimize JPEG files
brew "libexif" # EXIF parsing library

# Containers
brew "docker-clean" # Clean Docker containers, images, networks, and volumes
brew "kubernetes-cli" # Kubernetes command-line interface
brew "kubernetes-helm" # The Kubernetes package manager

# Geography
brew "geos" # Geometry Engine
brew "libspatialite" # Adds spatial SQL capabilities to SQLite
brew "gdal" # Geospatial Data Abstraction Library

# Apps
cask "alfred"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "mailplane"
cask "pycharm"
cask "sublime-text"
cask "xquartz"

mas "Affinity Designer", id: 824171161
mas "Fantastical", id: 975937182
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"

# Fonts
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-public-sans"
