tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "codeclimate/formulae"
tap "jakehilborn/jakehilborn"
tap "martido/brew-graph"
brew "autoconf"
brew "sqlite"
brew "azure-cli"
brew "bash"
brew "icu4c"
brew "gettext"
brew "cmake"
brew "docker-clean"
brew "expat"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "jpeg"
brew "geos"
brew "libspatialite"
brew "little-cms2"
brew "gdal"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "httpie"
brew "jpegoptim"
brew "jq"
brew "k3d"
brew "kubernetes-cli", link: false
brew "libexif"
brew "libmagic"
brew "libxmlsec1"
brew "lzlib"
brew "mackup"
brew "make"
brew "mas"
brew "ncurses"
brew "nano"
brew "node"
brew "openjdk@11"
brew "pandoc"
brew "postgis"
brew "postgresql@11", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv", args: ["HEAD"], link: false
brew "pyenv-virtualenvwrapper"
brew "sip"
brew "pyqt"
brew "qwt"
brew "rclone"
brew "redis", restart_service: true
brew "rename"
brew "ruby"
brew "spatialindex"
brew "stunnel"
brew "subversion"
brew "tree"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "jakehilborn/jakehilborn/displayplacer"
brew "martido/brew-graph/brew-graph"
cask "1password"
cask "alfred"
cask "beekeeper-studio"
cask "calibre"
cask "chromedriver"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-lato"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-public-sans"
cask "google-chrome"
cask "iterm2"
cask "java11"
cask "macdown"
cask "mailplane"
cask "pycharm"
cask "qgis"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "shapes"
cask "sublime-text"
cask "vagrant"
cask "xquartz"
mas "Affinity Designer", id: 824171161
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Table Tool", id: 1122008420
mas "The Unarchiver", id: 425424353
